tap "aws/tap"
tap "google/tink", "https://github.com/google/tink"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "microsoft/git"
tap "remotemobprogramming/brew"
tap "snyk/tap"
brew "adr-tools"
brew "autoconf"
brew "openssl@1.1"
brew "autojump"
brew "automake"
brew "aws-cdk"
brew "awscli"
brew "bash"
brew "bat"
brew "pkg-config"
brew "cfn-lint"
brew "cocoapods"
brew "coreutils"
brew "docker-credential-helper"
brew "libevent"
brew "gcc"
brew "gimme-aws-creds"
brew "git"
brew "git-flow"
brew "grep"
brew "htop"
brew "jq"
brew "libksba"
brew "libtool"
brew "lsd"
brew "openjdk"
brew "maven"
brew "zlib"
brew "mysql"
brew "nvm"
brew "openjdk@17"
brew "pnpm"
brew "podman"
brew "pyenv"
brew "python@3.8"
brew "python@3.9"
brew "redis"
brew "telnet"
brew "tfenv"
brew "thefuck"
brew "tmux"
brew "typescript"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "google/tink/tinkey"
brew "remotemobprogramming/brew/mob"
brew "snyk/tap/snyk"
cask "blackhole-2ch"
cask "box-tools"
cask "dbeaver-community"
cask "discord"
cask "drawio"
cask "figma"
cask "flutter"
cask "git-credential-manager-core"
cask "google-chrome"
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
cask "lastpass"
cask "ngrok"
cask "nosql-workbench"
cask "postman"
cask "rancher"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "atlassian.atlascode"
vscode "aws-scripting-guy.cform"
vscode "Boto3typed.boto3-ide"
vscode "Cameron.vscode-pytest"
vscode "christian-kohler.path-intellisense"
vscode "Codium.codium"
vscode "DaltonMenezes.aura-theme"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "DeepScan.vscode-deepscan"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "JosefBiehler.cypress-fixture-intellisense"
vscode "kavod-io.vscode-jest-test-adapter"
vscode "leizongmin.node-module-intellisense"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loganarnett.lambda-snippets"
vscode "luqimin.velocity"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mark-tucker.aws-cli-configure"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "orsenkucher.vscode-graphql"
vscode "Orta.vscode-jest"
vscode "pamaron.pytest-runner"
vscode "Percy.vscode-pydata-viewer"
vscode "PKief.material-icon-theme"
vscode "PlethoraOfHate.aws-actions"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "refraction.refraction"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sohibe.java-generate-setters-getters"
vscode "SonarSource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "TeamHub.teamhub"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "wayou.vscode-todo-highlight"
vscode "ZixuanChen.vitest-explorer"
