tap "aws/tap"
tap "google/tink", "https://github.com/google/tink"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "microsoft/git"
tap "remotemobprogramming/brew"
tap "snyk/tap"
brew "adr-tools"
brew "autoconf"
brew "openssl@1.1"
brew "autojump"
brew "automake"
brew "aws-cdk"
brew "awscli"
brew "bash"
brew "bat"
brew "cfn-lint"
brew "cocoapods"
brew "coreutils"
brew "docker-credential-helper"
brew "libevent"
brew "fastlane"
brew "gcc"
brew "gimme-aws-creds"
brew "git"
brew "git-lfs"
brew "git-remote-codecommit"
brew "grep"
brew "htop"
brew "jq"
brew "libksba"
brew "pkg-config"
brew "libtool"
brew "lsd"
brew "openjdk"
brew "maven"
brew "nvm"
brew "openjdk@17"
brew "pnpm"
brew "pyenv"
brew "python@3.8"
brew "python@3.9"
brew "rbenv"
brew "rust"
brew "telnet"
brew "tfenv"
brew "thefuck"
brew "tmux"
brew "typescript"
brew "watchman"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "google/tink/tinkey"
brew "remotemobprogramming/brew/mob"
cask "blackhole-2ch"
cask "box-tools"
cask "drawio"
cask "figma"
cask "finch"
cask "fleet"
cask "flutter"
cask "git-credential-manager"
cask "git-credential-manager"
cask "google-chrome"
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
cask "lastpass"
cask "nosql-workbench"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "cameron.vscode-pytest"
vscode "christian-kohler.path-intellisense"
vscode "codium.codium"
vscode "daltonmenezes.aura-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "deepscan.vscode-deepscan"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "leizongmin.node-module-intellisense"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "luqimin.velocity"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "nrwl.angular-console"
vscode "orsenkucher.vscode-graphql"
vscode "orta.vscode-jest"
vscode "pamaron.pytest-runner"
vscode "percy.vscode-pydata-viewer"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "plethoraofhate.aws-actions"
vscode "postman.postman-for-vscode"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sohibe.java-generate-setters-getters"
vscode "sonarsource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teamhub.teamhub"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
