tap "aws/tap"
tap "google/tink", "https://github.com/google/tink"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "remotemobprogramming/brew"
tap "sdkman/tap"
tap "snyk/tap"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Asynchronous event library
brew "libevent"
# Easiest way to build and release mobile apps
brew "fastlane"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# CLI to retrieve AWS credentials from Okta
brew "gimme-aws-creds"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git Remote Helper to interact with AWS CodeCommit
brew "git-remote-codecommit"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Hash utilities
brew "md5sha1sum", link: false
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Package management made easy
brew "pixi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# A command line tool to generate and manipulate keysets for the Tink cryptography library
brew "google/tink/tinkey"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Open-source AI-native IDE
cask "aide-app"
# Communications service
cask "amazon-chime"
# Photo storage and sharing service
cask "amazon-photos"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Create and edit any file directly from a web browser
cask "box-tools"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Password manager
cask "lastpass"
# Discover, download, and run local LLMs
cask "lm-studio"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# Get up and running with large language models locally
cask "ollama"
# Remote pair programming
cask "pop"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# Native desktop client for WhatsApp
cask "whatsapp"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codium.codium"
vscode "daltonmenezes.aura-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "deepscan.vscode-deepscan"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "leizongmin.node-module-intellisense"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "luqimin.velocity"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "narasimapandiyan.jetbrainsmono"
vscode "nrwl.angular-console"
vscode "orsenkucher.vscode-graphql"
vscode "orta.vscode-jest"
vscode "pamaron.pytest-runner"
vscode "percy.vscode-pydata-viewer"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "plethoraofhate.aws-actions"
vscode "postman.postman-for-vscode"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "saoudrizwan.claude-dev"
vscode "sohibe.java-generate-setters-getters"
vscode "sonarsource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teamhub.teamhub"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
